In [40]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import matplotlib
matplotlib.style.use('ggplot')

In [2]:
unames = ['user_id', 'gender', 'age', 'occupation', 'zip']
users = pd.read_table('ml-1m/users.dat', sep='::', header=None, names=unames, engine='python')

In [3]:
rnames = ['user_id', 'movie_id', 'rating', 'timestamp']
rating = pd.read_table('ml-1m/ratings.dat', sep="::", header=None, names=rnames, engine='python')

In [4]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('ml-1m/movies.dat', sep="::", header=None, names=mnames, engine='python')

In [5]:
users[:5]

   user_id gender  age  occupation    zip
0        1      F    1          10  48067
1        2      M   56          16  70072
2        3      M   25          15  55117
3        4      M   45           7  02460
4        5      M   25          20  55455

In [6]:
rating[:5]

   user_id  movie_id  rating  timestamp
0        1      1193       5  978300760
1        1       661       3  978302109
2        1       914       3  978301968
3        1      3408       4  978300275
4        1      2355       5  978824291

In [7]:
movies[:5]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

__**Perform joins**__
_____

In [8]:
data = pd.merge(pd.merge(rating, users), movies)
data[:5]

,user_id,movie_id,rating,timestamp,gender,age,occupation,zip,title,genres
0,1,1193,5,978300760,F,1,10,48067,One Flew Over the Cuckoo's Nest (1975),Drama
1,2,1193,5,978298413,M,56,16,70072,One Flew Over the Cuckoo's Nest (1975),Drama
2,12,1193,4,978220179,M,25,12,32793,One Flew Over the Cuckoo's Nest (1975),Drama
3,15,1193,4,978199279,M,25,7,22903,One Flew Over the Cuckoo's Nest (1975),Drama
4,17,1193,5,978158471,M,50,1,95350,One Flew Over the Cuckoo's Nest (1975),Drama

In [9]:
row_filter = data.iloc[:,2:3]
row_filter.head()

   rating
0       5
1       5
2       4
3       4
4       5

In [10]:
mean_ratings = data.pivot_table('rating', index='title', columns='gender', aggfunc='mean')

In [11]:
mean_ratings[:5]

gender                                F         M
title
$1,000,000 Duck (1971)         3.375000  2.761905
'Night Mother (1986)           3.388889  3.352941
'Til There Was You (1997)      2.675676  2.733333
'burbs, The (1989)             2.793478  2.962085
...And Justice for All (1979)  3.828571  3.689024

### Get the titles that were rated more than 250 times

In [12]:
ratings_by_title = data.groupby('title').size()
ratings_by_title.head()

title
$1,000,000 Duck (1971)            37
'Night Mother (1986)              70
'Til There Was You (1997)         52
'burbs, The (1989)               303
...And Justice for All (1979)    199
dtype: int64

Now let us apply a condition to the groupby to get the titles that were rated more than 250 times

In [13]:
# Using syntax : groupby_object.index[condition]
active_titles = ratings_by_title.index[ratings_by_title >= 250]
active_titles[:5]

Index([''burbs, The (1989)', '10 Things I Hate About You (1999)',
       '101 Dalmatians (1961)', '101 Dalmatians (1996)',
       '12 Angry Men (1957)'],
      dtype='object', name='title')

The index of titles that were rated more than 250 time

We can use this result to select rows from the mean_ratings

In [14]:
mean_ratings = mean_ratings.loc[active_titles]
mean_ratings.head()

gender                                    F         M
title
'burbs, The (1989)                 2.793478  2.962085
10 Things I Hate About You (1999)  3.646552  3.311966
101 Dalmatians (1961)              3.791444  3.500000
101 Dalmatians (1996)              3.240000  2.911215
12 Angry Men (1957)                4.184397  4.328421

### Find the top 35 rated movies

In [28]:
most_rated = data.groupby('title').size().sort_values(ascending=False)[:25]
most_rated

title
American Beauty (1999)                                   3428
Star Wars: Episode IV - A New Hope (1977)                2991
Star Wars: Episode V - The Empire Strikes Back (1980)    2990
Star Wars: Episode VI - Return of the Jedi (1983)        2883
Jurassic Park (1993)                                     2672
Saving Private Ryan (1998)                               2653
Terminator 2: Judgment Day (1991)                        2649
Matrix, The (1999)                                       2590
Back to the Future (1985)                                2583
Silence of the Lambs, The (1991)                         2578
Men in Black (1997)                                      2538
Raiders of the Lost Ark (1981)                           2514
Fargo (1996)                                             2513
Sixth Sense, The (1999)                                  2459
Braveheart (1995)                                        2443
Shakespeare in Love (1998)                               2369
Princess Bride, The (1987)                               2318
Schindler's List (1993)                                  2304
L.A. Confidential (1997)                                 2288
Groundhog Day (1993)                                     2278
E.T. the Extra-Terrestrial (1982)                        2269
Star Wars: Episode I - The Phantom Menace (1999)         2250
Being John Malkovich (1999)                              2241
Shawshank Redemption, The (1994)                         2227
Godfather, The (1972)                                    2223
dtype: int64

___We can use the agg method to pass a dictionary specifying the columns to aggregate (as keys) and a list of functions we'd like to apply.___

In [29]:
movie_stats = data.groupby('title').agg({'rating': [np.size, np.mean]})
movie_stats.head()

                              rating
                                size      mean
title
$1,000,000 Duck (1971)            37  3.027027
'Night Mother (1986)              70  3.371429
'Til There Was You (1997)         52  2.692308
'burbs, The (1989)               303  2.910891
...And Justice for All (1979)    199  3.713568

__Movies with the highest average score__

In [67]:
movie_stats = data.groupby('title').agg({'rating': [np.size, np.mean]})
movie_stats.sort_values([('rating', 'mean')], ascending=False).head()

                         rating
                           size mean
title
Ulysses (Ulisse) (1954)       1  5.0
Lured (1947)                  1  5.0
Follow the Bitch (1998)       1  5.0
Bittersweet Motel (2000)      1  5.0
Song of Freedom (1936)        1  5.0

In [76]:
grouped_by_title = data[['title', 'age']].groupby('title').agg({'age': [np.size, np.mean]})
grouped_by_title.head()

                               age
                              size       mean
title
$1,000,000 Duck (1971)          37  31.162162
'Night Mother (1986)            70  33.271429
'Til There Was You (1997)       52  28.826923
'burbs, The (1989)             303  27.897690
...And Justice for All (1979)  199  35.984925

### Assignment 1 - Objective 1 
** Data Exploration: Aggregate(sum) of movie rating for each genre **

In [16]:
# First interpretation of (Aggregate)

genre_ratings = data.pivot_table('rating', index='genres', aggfunc=np.sum)
genre_ratings.head()

                                               rating
genres
Action                                          41302
Action|Adventure                                38408
Action|Adventure|Animation                       1431
Action|Adventure|Animation|Children's|Fantasy     365
Action|Adventure|Animation|Horror|Sci-Fi         2192

In [17]:
# Second interpretation of the same question 

genre_ratings = data.pivot_table('rating', index='genres')
genre_ratings.head()

                                                 rating
genres
Action                                         3.354886
Action|Adventure                               3.676814
Action|Adventure|Animation                     4.147826
Action|Adventure|Animation|Children's|Fantasy  2.703704
Action|Adventure|Animation|Horror|Sci-Fi       3.546926

### Assignment 1 - Objective 2
** Data Exploration: The top 5 highest ranked genre by women **

In [18]:
mean_gender_rankings = data.pivot_table('rating', index='genres', columns='gender')
mean_gender_rankings.head()

gender                                                F         M
genres
Action                                         3.367474  3.352991
Action|Adventure                               3.701213  3.671115
Action|Adventure|Animation                     3.843750  4.217082
Action|Adventure|Animation|Children's|Fantasy  3.146341  2.510638
Action|Adventure|Animation|Horror|Sci-Fi       3.422535  3.563071

In [19]:
top_5_ranked_by_women = mean_gender_rankings.sort_values(by="F", ascending=False)[:5]
top_5_ranked_by_women

gender                                     F         M
genres
Animation|Comedy|Thriller           4.550802  4.445110
Animation                           4.533333  4.353107
Film-Noir|Romance|Thriller          4.448718  4.211073
Sci-Fi|War                          4.376623  4.464789
Adventure|Children's|Drama|Musical  4.355030  4.203138

### Assignment 1 - Objective 3
** Data Exploration: The top 5 highest ranked genre by men. **

In [20]:
top_5_ranked_men = mean_gender_rankings.sort_values(by="M", ascending=False)[:5]
top_5_ranked_men

gender                            F         M
genres
Sci-Fi|War                 4.376623  4.464789
Animation|Comedy|Thriller  4.550802  4.445110
Film-Noir|Mystery          4.319444  4.381536
Adventure|War              4.187970  4.376633
Animation                  4.533333  4.353107

### Assignment 1 - Objective 4
** Data Exploration: A breakdown of a movies ratings by age, use any movie of your choice. **
___

In [21]:
breakdown_movies_age = data.pivot_table('rating', index="title", columns="age", fill_value=0)
breakdown_movies_age.head()

age,1,18,25,35,45,50,56
title,,,,,,,
"$1,000,000 Duck (1971)",0.0,3.000000,3.090909,3.133333,2.000000,2.750000,0.000000
'Night Mother (1986),2.0,4.666667,3.423077,2.904762,3.833333,3.555556,4.333333
'Til There Was You (1997),3.5,2.500000,2.666667,2.900000,2.333333,2.500000,2.666667
"'burbs, The (1989)",4.5,3.244444,2.652174,2.818182,2.545455,3.208333,2.666667
...And Justice for All (1979),3.0,3.428571,3.724138,3.657143,4.100000,3.551724,3.928571

_Now that we have all the movie breakdown by age, we can narrow down to one movie: **Toy Story**_

In [22]:
breakdown_toy_story = breakdown_movies_age.loc['Toy Story (1995)']
breakdown_toy_story.head()

age
1     3.919643
18    4.017857
25    4.201266
35    4.302600
45    4.104895
Name: Toy Story (1995), dtype: float64

### Assignment 1 - Objective 5
** Data Exploration: A function that given a user id and movie id , returns a list of user ids for
other users that rated the movie identified by the provided movie id with the same score.. **
___

In [23]:
# Contract: Number Number -> List of Numbers
# Purpose: Given a search_user_id and search_movie_id return a list of target_user_ids who rated the same movie with the same score
def like_minded(search_user_id, search_movie_id):
    # Find the rating the search_user_id gave to the movie_id
    given_rating = data[(data.user_id == search_user_id) & (data.movie_id == search_movie_id)]
    rating = given_rating['rating']
    rating = int(rating)
    # Used that rating and movie_id to find other users_id
    similar_users_rating = data[(data.rating == rating) & (data.movie_id)]
    users = similar_users_rating['user_id']
    users = list(users)
    # remove the user_id for the user you used to search
    users.remove(search_user_id)
    # return the list of user_ids
    return users

In [24]:
# Testing the above method
# For user (2) Search for users that also ranked the movie defined by movie_id (1193)
like_minded(2, 1193)[:10]

[1, 17, 19, 24, 33, 39, 53, 54, 58, 81]

### Assignment 1 - Objective 6
** Data Exploration: Some other statistic, figure, aggregate, or plot that you created using this dataset,
along with a short description of what interesting observations you derived from it. **

In [81]:
grouped_by_title = data[['title', 'age', 'rating']].groupby('title').agg({'age':  np.mean,
                                                                         'rating': [np.size, np.mean]})
grouped_by_title.head()

                                     age rating
                                    mean   size      mean
title
$1,000,000 Duck (1971)         31.162162     37  3.027027
'Night Mother (1986)           33.271429     70  3.371429
'Til There Was You (1997)      28.826923     52  2.692308
'burbs, The (1989)             27.897690    303  2.910891
...And Justice for All (1979)  35.984925    199  3.713568

### Description
__ For each title find out the average age of people who rate it and the rating it gets __  ** This helps us indirectly find out which titles appeal to which audience **
> __ For example we could argue that **'burbs, the(1989)'** does not seem to appeal to the late 20's audience because on average that age range gives it a poor rating and this argument is futher enhanced by the size of ratings that produced that average.

### Grade: 95/100
> 1. 10/10
> 2. 10/10
> 3. 10/10
> 4. 15/20 The breakdown suppose to have different ages labled as age groups. You can see examples in the given blog in assignment1.
> 5. 30/30
> 6. 20/20

Well done!

PS: Actually the dataset is out of date, we got a new seperate-genre dataset on slack for you to get a better result. Your code looks right, if using the new dataset would get a better result. Give it a try.